app/views/folders/index.html.erb

        <%= link_to(folder_name.folder_name,  "/folders/#{folder_name.id}") %>
        <br> <%= Folder.where(foldername_id: folder_name.id).count %> </br>
---
SELECT COUNT(*) FROM "folders" WHERE "folders"."foldername_id" = ?  [["foldername_id", 1]]