app/views/folders/show_folder.html.erb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 23], ["LIMIT", 1]]
---
      <div class="posts-index-item">
        <% @post = Post.find_by(id: folder.post_id) %>