app/views/posts/show.html.erb

SELECT "folder_names".* FROM "folder_names" ORDER BY "folder_names"."created_at" DESC
---
        <%= n.label :id %>
        <%= n.collection_select :id, FolderName.all, :id, :name %>