app/controllers/folders_controller.rb

  def index
    @folder_names = FolderName.all.order(created_at: :desc)
---
SELECT "folder_names".* FROM "folder_names" ORDER BY "folder_names"."created_at" DESC

  def create
    @folders = Folder.new(post_id: params[:post_id])
    @folders.save
---
INSERT INTO "folders" ("post_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["post_id", 23], ["created_at", "2019-11-29 14:35:01.923098"], ["updated_at", "2019-11-29 14:35:01.923098"]]

  def show_folder
    @folders = Folder.where(foldername_id: params[:foldername_id])
---
SELECT  "folders".* FROM "folders" WHERE "folders"."foldername_id" = ? LIMIT ?  [["foldername_id", 1], ["LIMIT", 1]]