app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "created_at", "updated_at", "image_name") VALUES (?, ?, ?, ?)  [["content", "aaaaaaa"], ["created_at", "2019-11-27 08:51:07.868541"], ["updated_at", "2019-11-27 08:51:07.868541"], ["image_name", "karaage.jpg"]]
---
  def create
  #  @post = Post.new(content: params[:content])
    @post = Post.new(post_params)
    #if params[:image]
      #@post.image_name = "#{@post.id}.jpg"
      #File.binwrite("public/post_images/#{@post.image_name}", image.read)
  #  end

    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]
UPDATE "posts" SET "image_name" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["image_name", nil], ["updated_at", "2019-11-28 08:59:07.813588"], ["id", 24]]
---
  def update
    @post = Post.find_by(id: params[:id])
    @post.content = params[:content]
    if params[:image_name]
      @post.image_name = params[:image_name]
    elsif params[:remove_image]
      @post.image_name = nil
    end

  #  if params[:image]
    #  @post.image_name = "#{@post.id}.jpg"
    #  image = params[:image]
    #  File.binwrite("public/uploads/post/image_name/#{@post.id}/#{@post.id}.jpg", image.read)
  #  end

    if @post.save